%%Για την αναφορά του τρίτου εργαστηρίου των κυκλωμάτων
%%Μανώλης 29/11/2019
close all
clear all
%% Συντονιζόμενο RC -- 4ο κύκλωμα

kHz=[1.08 1.65 2 2.16 2.48 2.68 2.76 2.86 2.88 2.9 2.96 3.06 3.16 3.32 4 5.77];
v0pp_div=[1 2 3 4 4.8 5.6 5.4 5 4.6 4.4 4 3.6 3.2 2.8 2 1.2];
v0pp_volts=v0pp_div;

a=v0pp_volts./10;
db=20*log10(a);

hold on;
figure(1);
axis([0 7 -21 -4]);
scatter(kHz, db, 'o');
plot(kHz, db);
xlabel('f(kHz)');
ylabel('20log|H(jω)| (dB)');
title('Διάγραμμα Bode για το πλάτος της συνάρτησης μεταφοράς συντονιζόμενου RLC κυκλώματος');
hold off;
