%%Για την αναφορά του τρίτου εργαστηρίου των κυκλωμάτων
%%Μανώλης 29/11/2019
close all
clear all
%% Ζωνοπερατό RC -- 3ο κύκλωμα

kHz=[0.349 0.449 0.562 0.797 1.02 2.986 6.36 8.17 9.15 9.73 11.18 13 18 21 34.8 95];
v0pp_div=[1 1.2 1.4 1.7 2 2.4 2.3 2.2 2.1 2 1.7 1.5 1.2 1.1 0.8 0.4];

v0pp_volts=v0pp_div;

a=v0pp_volts./10;
db=20*log10(a);

hold on;
figure(1);
axis([-1 100 -30 -10]);
scatter(kHz, db, 'o');
plot(kHz, db);
xlabel('f(kHz)');
ylabel('20log|H(jω)| (dB)');
title('Διάγραμμα Bode για το πλάτος της συνάρτησης μεταφοράς ζωνοπερατού RC κυκλώματος');
hold off;
